#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/digital-nomad-school/dns-mlp-lab/runs/run-62ezpTTDQXi9RHhx

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
data.digitalocean_kubernetes_versions.prefix: Reading...
data.digitalocean_kubernetes_versions.prefix: Read complete after 1s [id=terraform-20230227201721906200000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.mlp will be created
  + resource "digitalocean_kubernetes_cluster" "mlp" {
      + auto_upgrade   = true
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + ha             = false
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "mlp"
      + region         = "fra1"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = true
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.25.4-do.0"
      + vpc_uuid       = (known after apply)

      + maintenance_policy {
          + day        = "sunday"
          + duration   = (known after apply)
          + start_time = "4:00"
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = false
          + id                = (known after apply)
          + name              = "worker-pool"
          + node_count        = 2
          + nodes             = (known after apply)
          + size              = "s-2vcpu-2gb"
        }
    }

  # digitalocean_project.mlp will be created
  + resource "digitalocean_project" "mlp" {
      + created_at  = (known after apply)
      + description = "Minimal Lovable Product"
      + environment = "Development"
      + id          = (known after apply)
      + is_default  = false
      + name        = "mlp"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "Digital Nomad School project kickoff"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

  # digitalocean_vpc.k8s-vpc will be created
  + resource "digitalocean_vpc" "k8s-vpc" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "k8s-vpc"
      + region     = "fra1"
      + urn        = (known after apply)

      + timeouts {
          + delete = "4m"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @skleymenov, Action: `pull_request`*